Tekla Open API Reference for Tekla Structures 2025
RebarLengthAdjustmentDataNullable.LengthAdjustmentTypeEnum Enumeration
 The length adjustment type.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum LengthAdjustmentTypeEnum
Public Enumeration LengthAdjustmentTypeEnum
Members
Member name | Value | Description
NO_ADJUSTMENT | 0 |  No adjustment.
END_OFFSET | 1 |  End offset.
LEG_LENGTH | 2 |  Leg length.
See Also
Reference
Tekla.Structures.Model Namespace